Repository: ortegonjuanca/EnoApp
Catalog: lib/l10n/app_*.arb
Languages: es

# language
source: English
es: Español

# codigo_lenguaje
source: en
es: es

# appbar_menu
source: Main Menu
es: Menú Principal

# tooltip_menu_navegacion
source: Navigation Menu
es: Menú de Navegación

# tooltip_ajustes
source: Settings
es: Ajustes

# snackbar_cerrar
source: Close
es: Cerrar

# cancelar
source: Cancel
es: Cancelar

# aceptar
source: Confirm
es: Aceptar

# tooltip_eliminar_calculo
source: Remove Calculation
es: Eliminar Cálculo

# tooltip_nuevo_calculo
source: New Calculation
es: Nuevo Cálculo

# tooltip_editar_calculo
source: Edit Calculation
es: Editar Cálculo

# tooltip_guardar_calculo
source: Save Calculation
es: Guardar Cálculo

# calcular
source: Calculate
es: Calcular

# guardar
source: Save
es: Guardar

# titulo
source: Title
es: Título

# fecha
source: Date
es: Fecha

# observaciones
source: Notes
es: Observaciones

# fortificar_vino
source: Fortify Wine
es: Fortificar Vino

# hidratar_vinagre
source: Hydrate Vinegar
es: Hidratar Vinagre

# historial_fortificaciones
source: Historical Fortifications
es: Historial Fortificaciones

# historial_hidrataciones
source: Historical Hydrations
es: Historial Hidrataciones

# volumen_vino_alcoholizar
source: Volume of wine to be fortified (liters)
es: Volumen de vino que se desea alcoholizar (litros)

# grado_vino
source: Alcoholic strength of the wine to be fortified (% Vol)
es: Grado del vino a alcoholizar (% Vol)

# grado_deseado
source: Alcoholic strength of the wine desired (% Vol)
es: Grado del vino que se desea (% Vol)

# grado_alcohol_dispone
source: Alcoholic strength available (% Vol)
es: Grado del alcohol del que se dispone (% Vol)

# volumen_alcohol_necesario
source: Volume of alcohol required (liters)
es: Volumen de alcohol necesario (litros)

# datos_fortificacion
source: Fortification Data
es: Datos de la Fortificación

# calculo_anadido_bbdd
source: The calculation has been added to the database correctly
es: El cálculo se ha añadido a la base de datos correctamente

# fortificacion_error1
source: The value of the volume of wine to be fortified is required
es: El valor del volumen de vino a alcoholizar es requerido

# fortificacion_error2
source: The value of alcoholic strength of the wine to be fortified is required.
es: El valor del grado del vino a alcoholizar es requerido

# fortificacion_error3
source: The value of the desired alcoholic strength of the wine is required
es: El valor del grado del vino que se desea es requerido

# fortificacion_error4
source: The value of the alcoholic strength available is required
es: El valor del grado del alcohol del que se dispone es requerido

# fortificacion_error5
source: The value of the volume of wine to be fortified must be a whole number greater than 0
es: El valor del volumen de vino a alcoholizar debe ser un número entero mayor que 0

# fortificacion_error6
source: You already have the wine at {decimal_grado_vino_deseado}ยบ GL. Do not add anything
es: Ya tiene el vino a {decimal_grado_vino_deseado}º GL. No debe añadir nada

# fortificacion_error7
source: The desired alcoholic strength may not be less than the alcoholic strength of the wine to be fortified
es: El grado alcohólico deseado no puede ser menor que el grado del vino a alcoholizar

# fortificacion_error8
source: The strength of the alcohol available may not be less than or equal to the desired alcoholic strength
es: El grado del alcohol del que se dispone no puede ser menor o igual que el grado alcohólico deseado

# introduce_datos
source: ENTER THE FOLLOWING DATA
es: INTRODUCE LOS SIGUIENTES DATOS

# titulo_requerido
source: Title is required
es: El título es requerido

# fortificacion_existente
source: A fortification with that title already exists
es: Ya existe una fortificación con ese título

# calculo_eliminado_bbdd
source: '{title}' has been correctly removed
es: '{title}' ha sido eliminado correctamente

# no_observaciones
source: No notes provided
es: No se han proporcionado observaciones

# editado_correctamente
source: It has been correctly edited
es: Se ha editado correctamente

# tooltip_eliminar_fortificacion
source: Remove Fortification
es: Eliminar Fortificación

# tooltip_editar_fortificacion
source: Edit Fortification
es: Editar Fortificación

# volumen_vinagre_hidratar
source: Volume of vinegar to be hydrated (liters)
es: Volumen de vinagre que se desea hidratar (litros)

# grado_vinagre
source: Degree of vinegar to be hydrated (% Vol)
es: Grado del vinagre a hidratar (% Vol)

# grado_vinagre_deseado
source: Desired vinegar degree (% Vol)
es: Grado del vinagre que se desea (% Vol)

# volumen_agua_necesaria
source: Volume of water to be added (liters)
es: Volumen de agua a añadir (litros

# datos_hidratacion
source: Hydratation Data
es: Datos de la Hidratación

# hidratacion_error1
source: The value of the volume of vinegar to be hydrated is required
es: El valor del volumen de vinagre a hidratar es requerido

# hidratacion_error2
source: The value of the degree of vinegar to be hydrated is required
es: El valor del grado del vinagre a hidratar es requerido

# hidratacion_error3
source: The value of the desired vinegar degree is required
es: El valor del grado del vinagre que se desea es requerido

# hidratacion_error4
source: The value of the volume of vinegar to be hydrated must be a whole number greater than 0
es: El valor del volumen de vinagre a hidratar debe ser un número entero mayor que 0

# hidratacion_error5
source: The desired vinegar acetic strength value must be a whole number greater than 0
es: El valor del grado acético de vinagre deseado debe ser un número entero mayor que 0

# hidratacion_error6
source: You already have the vinegar at {decimal_grado_vinagre_deseado}ยบ. Do not add anything
es: Ya tiene el vinagre a {decimal_grado_vinagre_deseado}º. No debe añadir nada

# hidratacion_error7
source: The desired acetic strength must not be higher than the degree of the vinegar to be hydrated
es: El grado acético deseado no puede ser mayor que el grado del vinagre a hidratar

# hidratacion_existente
source: A hydratation with that title already exists
es: Ya existe una hidratación con ese título

# tooltip_eliminar_hidratacion
source: Remove Hydratation
es: Eliminar Hidratación

# tooltip_editar_hidratacion
source: Edit Hydratation
es: Editar Hidratación

# seguro_eliminar
source: Are you sure you want to delete '{title}'?
es: ¿Estás seguro que desea eliminar '{title}'?

# accion_irreversible
source: This action is irreversible
es: Esta acción es irreversible
